[{"title":"[Project]  Lumen","date":"2026-01-02T11:25:39.907Z","path":"2026/01/02/lumen/","text":"Lumen 1. Motivation: Forcing System State Onto the DeskLumen started from a simple failure mode: system and application state stayed trapped behind windows and logs. Nothingon the desk moved, blinked, or sounded different when builds broke, power spiked, or motion changed. The workspacestayed visually flat even when the machine was on fire. The goal for Lumen was to clamp on that gap and build a desk-first, programmable hardware presence: Link software and system state to physical feedback: lights, motion, sound, display. Keep the device useful even when the host PC is detached. Avoid custom programmers and opaque tools so users don’t get blocked before the first boot. That forced three constraints: Fully open source, firmware-level programmable.No “vendor firmware” blob that can’t be rebuilt. Straightforward build and flash flow.A user with a browser should be able to flash CI-produced binaries through WebUSB without installing a toolchain. Long-term desktop value over peak performance.If a small performance win broke reproducibility or required special jigs, it got dropped. These constraints shaped everything: the stack, the drivers, and how the CI pipeline was wired. 2. Project Framework Design2.1 Hardware Platform and System LayoutThe hardware (v2) locks in the capabilities and therefore the firmware structure: MCU: ESP32‑C3 Sensors and IO: LSM6DSO IMU INA226 current sensor Buzzer Rotary encoder Display: 240×240 panel, ST7789‑like, driven via esp_lcd Power and connectivity: USB‑C Power switch This stack forced a design where display throughput, motion sampling, power monitoring, and host I/O all runconcurrently without clobbering each other, under FreeRTOS. 2.2 Firmware Stack: FreeRTOS Core, Layered DriversAt the firmware level, Lumen runs on ESP‑IDF v5.5 with FreeRTOS. The project is structured in layers rather than onemonolithic main.c: Hardware drivers (C/C++): Display panel via esp_lcd I2C plumbing for LSM6DSO and INA226 Rotary encoder and buzzer USB serial‑JTAG interface System integration and logic: FreeRTOS task graph Motion task UI rendering pipeline Host serial protocol Rust no‑std component (main_app): Sits only in the system integration layer. Does not replace the C/C++ hardware drivers. Avoids a split stack where half the drivers live in one language and half in another. Rust was pulled in specifically where it helped structure higher‑level integration logic, not to rewrite vendor SDKsurfaces. That constraint prevented a steady stream of build and tooling failures from dual ecosystems fighting eachother. 2.3 UI Stack: Vision‑UI on u8g2 on ST7789The display stack uses a layered approach to keep UI changes from breaking lower layers: Vision‑UI: a small embedded UI library. u8g2: provides a mono framebuffer and drawing primitives. Panel driver: ST7789‑like display, driven via esp_lcd APIs. Implementation lives in main/src/ui_hardware_driver.cpp: A global PANEL handle ties into esp_lcd. The UI code only sees a framebuffer and a driver callback to “send buffer,” not the exact panel timing. This wiring means: UI layout changes do not force display driver changes. Display driver swaps stay local to the esp_lcd layer. The top‑level logic doesn’t need to know about DMA allocations or RGB565 conversions. 2.4 Build and Release: CI‑First, Web Flash SecondThe build system is pinned down in .github/workflows/build.yml: GitHub Actions installs: ESP‑IDF v5.5 A minimal Rust toolchain The RISC‑V target for ESP32‑C3 CI runs idf.py build and produces firmware artifacts. Those artifacts feed a web flashing flow: Browser + WebUSB grabs the CI artifact and flashes the board. No local ESP‑IDF or Rust installation is required for basic users. This flow looked heavier than a one‑off local build, but it removed a constant failure mode: users blocked by toolchainsetup. All complexity is clamped into CI instead of onto every developer’s machine. 3. Overhead Balance and Tradeoffs3.1 Reproducibility vs. PerformanceSeveral design choices pulled away from “fastest possible” and toward “reproducible and survivable”: Using ESP‑IDF v5.5 and esp_lcd adds abstraction and some overhead vs. hand‑tuned register banging, but: It keeps code aligned with upstream. It avoids a fragile, undocumented display driver that breaks when the next board spin rearranges pins. Driving the display through a u8g2 mono framebuffer and then converting to RGB565 is not the fastest route: A direct color framebuffer could shave steps. But it would lock UI code into a specific panel format. The chosen route makes assets and widgets less brittle when the panel or bus changes. The README explicitly notes that squeezing the last bit of performance did not win over long‑term desktop usefulness andreproducibility. 3.2 Independence from the Host PCAnother hard constraint: the device must hold value even when unplugged from any PC. Two consequences: Core logic cannot depend on serial I/O: The serial pack protocol (host interaction) is optional. Motion processing, display updates, and protection logic run without any host. UI decoupled from top‑level logic: Input handling and UI rendering can change without rewriting the control loop. Firmware doesn’t stall if the serial channel drops or a host app misbehaves. This avoids a failure mode where an absent or crashed host application bricks device usefulness. 3.3 Web Flashing LimitationsThe web flashing path trades one class of problems for another: Dependency on WebUSB support: Some browsers and platforms simply do not support it. In those cases, the user is forced back to local tooling. No CI caching yet: The current CI build workflow does not cache IDF or build artifacts. Every build re‑does configuration and compilation. Builds therefore take longer than necessary. The README calls these out instead of hiding them. Build times can be improved later by inserting caching or diffbuilds, but correctness and repeatability were prioritized first. 4. Display Pipeline: Double‑Buffered DMA Under Pressure4.1 Design ConstraintThe display needed to refresh a 240×240 panel without stalling the MCU or blocking other tasks. Direct full‑frame copieswould overflow time budgets and starve motion and serial tasks. To avoid that, the implementation uses line‑based double buffering with DMA‑capable memory: Defined in main/src/ui_hardware_driver.cpp. Globals and constants: S_LINES[2]: two DMA‑capable line buffers. S_BUF_BUSY[2]: flags to track which buffer is in-flight. PARALLEL_LINES: number of lines per chunk; set to 128. PANEL: esp_lcd_panel_handle_t. 4.2 Pipeline Behavior Initialization (displayInit): Allocates S_LINES[0] and S_LINES[1] with heap_caps_malloc using MALLOC_CAP_DMA | MALLOC_CAP_INTERNAL. Sets up the panel via esp_lcd, including a callback: onColorTransDone: fires when DMA completes for a chunk. Rendering (vision_ui_driver_buffer_send): UI code provides a mono u8g2 framebuffer. The driver: Splits it into RGB565 blocks of PARALLEL_LINES height. For each block: Finds a non‑busy buffer (S_BUF_BUSY[i] == false). Converts mono data into RGB565 into that buffer. Calls esp_lcd_panel_draw_bitmap on PANEL for that chunk. Marks buffer busy. DMA completion (onColorTransDone): Clears the corresponding S_BUF_BUSY[i]. Signals that chunk buffer is ready to be reused. This design keeps the CPU from sitting on long blocking writes. Conversion and DMA transfer are overlapped: while onebuffer is in flight, the other can be filled. 4.3 Tradeoffs Pros: Reduced stalls on the display path. Predictable memory footprint via PARALLEL_LINES control. Easier tuning for future panels. Cons: Extra copy step: mono → RGB565. More state to track (S_BUF_BUSY, callbacks). Harder debugging when transfers misalign. The double‑buffering logic is deliberately localized in ui_hardware_driver.cpp so that higher layers don’t need toknow about DMA or panel quirks. 5. Motion Processing: IMU Task and Filters5.1 Motion Task SetupMotion handling sits in its own FreeRTOS task to avoid blocking UI or serial operations. Implementation: main/src/motion.cpp. Key pieces: IMU: LSM6DSO I2C access: shared handle, with wrappers: imuWrite imuRead imuWriteThenRead Task: motionInit sets up IMU and spawns motionTask with xTaskCreate. Target rate: roughly 25 Hz. 5.2 Orientation EstimationTwo filter paths run on the sensor data: 2‑state Kalman filter (espp::KalmanFilter&lt;2&gt;, S_KF): Tracks roll and pitch. Smooths noisy accel/gyro inputs. Madgwick filter (MADGWICK): Provides full orientation (quaternion). Fuses accelerometer and gyroscope data. 5.3 Mounting Fix and Accel ScalingThe physical mounting ended up upside‑down relative to the IMU’s default orientation. That broke orientation outputearly on. The fix: Axis flip: Y and Z axes are flipped. Gyro axes are also flipped accordingly. Without this correction, roll/pitch estimates were mirrored and drifted in unexpected ways. To keep the acceleration magnitude sane: Adaptive accel scaling: Normalizes magnitude to approximately 9.80665 m/s². Prevents gravity from drifting away due to calibration offsets. This scaling avoids overflow in the filters and reduces long‑term drift. 5.4 Runtime BehaviorThe motion task: Samples the IMU at ~25 Hz. Runs the Kalman and Madgwick updates. Exposes motion/pose data internally (and via host protocol). By isolating this in one task, any stalls in host communication or display updates do not directly block sensor reads.If CPU load increases, sampling may drop somewhat, but the rest of the system keeps running. 6. Serial “Pack” Protocol: Host Integration Without Entanglement6.1 RequirementsHost connectivity needed to: Support structured commands and payloads. Avoid a tangled binary protocol that blocks easy debugging. Stay optional: no hard dependency for core firmware behavior. 6.2 Protocol StructureThe serial pack protocol lives in main/src/serial_pack.cpp and runs over the USB serial‑JTAG interface. Basic flow for each message: Path: ASCII string. Terminated by newline (\\n). Example: motion/data\\n. Length: 4‑byte little‑endian integer. Specifies payload size. Payload: Binary blob of that length. A handler table routes messages based on the path. 6.3 Implementation DetailsConstants: K_MAX_HANDLERS = 2Small fixed table; keeps memory fixed and simple. K_MAX_DATA_LEN = 2048Hard clamp to prevent payloads from blowing up buffers. K_RX_TIMEOUT_US = 3 * 1000 * 10003‑second receive timeout. Main functions: serialPackInitSets up state. serialPackAttachHandlerRegisters handler callbacks: Up to K_MAX_HANDLERS. Each handler keyed by path string. serialPackStart / serialPackTaskRuns the read loop: Reads the path until newline. Parses the 4‑byte length. If length &gt; K_MAX_DATA_LEN, the message is effectively rejected. Reads the payload in chunks: Dispatches chunks incrementally to handlers. Applies timeout via K_RX_TIMEOUT_US. Optional logging/preview to help debugging. 6.4 Tradeoffs and Failure Modes Low handler count (K_MAX_HANDLERS = 2): Forces consolidation of endpoints. Prevents unbounded growth of handler registrations. Payload clamp (K_MAX_DATA_LEN = 2048): Protects against memory blow‑ups if a host goes rogue. Blocks large streaming use cases unless the protocol is extended. Timeout (K_RX_TIMEOUT_US = 3s): Prevents the parser from hanging forever on partial messages. Under poor USB conditions, packets might get dropped or truncated when the timeout triggers. By keeping the protocol text‑framed on the path and length‑delimited on the payload, debugging is still manageable withsimple serial tools. 7. Features and Observed Results7.1 Hardware Feature Set (v2)From the README and hardware directory, v2 boards include: Display: 240×240 ST7789‑like panel. Motion: LSM6DSO IMU. Power: INA226 current sensor on USB‑C path. Interaction: Rotary encoder. Buzzer. Power control: physical power switch. This combination gives enough axes—visual, motion, and sound—to map varied system state into desk‑visible behavior. 7.2 Implemented Firmware CapabilitiesFirmware features visible in the repository: USB‑C power monitoring and protection: INA226 sensor used for current/voltage measurements. Protection logic clamps down on unsafe conditions (details wired into the system logic). Motion tracking: IMU readout with Kalman and Madgwick filters. Mounting fix applied for orientation correctness. UI rendering via Vision‑UI: Framebuffer driven UI. Display assets embedded in firmware: ui_assets_provider.cpp provides embedded images/fonts for Vision‑UI. Host communication: Serial pack protocol over USB serial‑JTAG. Structured path + length framing. Web quick flashing: CI‑produced artifacts used directly by the web flasher. No local toolchain needed for basic flashing. 7.3 Runtime Behavior and ObservationsIn combined operation, the system: Refreshes the 240×240 panel with double‑buffered DMA without starving FreeRTOS tasks. Samples motion at ~25 Hz while filtering orientation in real time. Streams motion and state over the serial pack protocol when a host is present. Continues to function (UI, motion, basic behavior) without any serial host connected. Overhead is clearly present: layered UI, filters, serial protocol, CI scaffolding. But each layer was added in responseto a concrete failure mode—tooling blockage, display stalls, incorrect orientation, unsafe power behavior—rather than asabstract design. Lumen ends up as a reproducible, firmware‑level programmable desk companion that ties system state into light, motion,and sound without depending on a constant host tether.","link":"","tags":[{"name":"ece","slug":"ece","permalink":"https://www.robcholz.com/tags/ece/"},{"name":"software","slug":"software","permalink":"https://www.robcholz.com/tags/software/"},{"name":"proj","slug":"proj","permalink":"https://www.robcholz.com/tags/proj/"}]},{"title":"[Project]  Vision-UI","date":"2025-11-16T19:02:00.000Z","path":"2025/11/16/vision-ui/","text":"Vision-UIIntroductionOn most small embedded displays I’ve worked with, the hardware is fast enough, but the motion still doesn’t feel right.Animations often look choppy or patched together. I wanted to see whether a basic MCU — for example, an STM32F1 driving a 128×64 display — could produce motion that feelsmore natural while staying lightweight enough for small devices. This eventually became Vision UI.But the goal wasn’t to “build a UI framework.”It was mainly an attempt to understand what makes smooth motion and consistent visual behavior possible on tinyhardware. On small devices, smoothness doesn’t come for free.Every animation curve, frame, and pixel shift has to contend with timing jitter, limited RAM, SPI bandwidth, and astrict per-frame time budget. Vision UI is just the structure that formed while working through those constraints. PositioningWhere Vision UI sits among existing embedded UI options Dimension Vision UI u8g2 + manual LVGL Displays Small mono/TFT Mono/basic TFT Color + touch Goal Smooth motion Minimal draw logic Full GUI stack Abstraction Medium Low High Animation 2nd-order ODE None/ad-hoc Built-in Memory Low, predictable Very low High Widgets Lists/icons Custom Rich Code growth Centralized Scattered Centralized/config-heavy Portability HAL + PC sim Project-specific Ecosystem Learning curve Medium Low High Best for Small smooth UIs Simple menus Complex HMI NoteVision UI fills a specific gap between “handwritten drawing code” and “full GUI stacks”: If you only need a couple of static menus, handwritten u8g2 code is often enough. For complex touch interfaces, LVGL is the obvious choice. Vision UI lives in between: small OLED/TFT screens that mainly show lists or simple layouts, but still benefit fromconsistent, smooth motion, and swift development. System DesignThe constraints that shaped the design were straightforward: ~64 KB usable RAM 128×64 / 240×240 displays with partial/full buffers SPI/I2C bandwidth ceilings Unstable tick timing on MCU boards ~3–4 ms per frame Font rendering cost and limited caching The constraints drove most of the decisions.The framework grew as I worked through the hardware limits, rather than from a big upfront design. AnimationEasing curves often look fine on isolated transitions, but they fall apart once you interrupt them.Velocity doesn’t carry over, motions don’t combine well, and the transitions feel arbitrary. A second-order ODE works better in this environment: continuous velocity natural-looking acceleration smooth interruption behavior single-parameter responsiveness intuitive to tune Critically damped (no overshoot) Lightly under-damped (with overshoot) Interrupting animations and handling unstable dt required a few fixes (clamping, integration limits, etc.), but oncestable, the ODE motion system made the rest of the UI logic much simpler. No-overshoot demo Light overshoot demo ChallengesA few issues took more time than expected: Keeping animation stable under variable frame times Making the motion system interrupt-friendly without breaking state Tuning motion parameters for responsiveness without losing natural behavior Keeping layout and animation logic consistent across driver backends Balancing smooth motion against a tight per-frame time budget PerformanceOn a 240x240 OLED, Vision UI reaches around 220 FPS with the motion system active.CPU usage stays under ~30% in my tests (at a fixed 80 FPS). ConclusionWorking on this made me realize how little room small systems give you.You end up keeping only what’s necessary. If I were starting over, I’d probably build the motion system first, since it influences most of the other pieces. I’m already using Vision UI in a few side projects, and I’ll keep adjusting it as new use cases show up. TipI’ll keep adding details as the project moves forward.If you’d like to follow along, you can find my Reddit and YouTube links under Relevant Links in the left menu.","link":"","tags":[{"name":"proj","slug":"proj","permalink":"https://www.robcholz.com/tags/proj/"}]},{"title":"[Foundation] Applied Electronics","date":"2025-09-29T01:13:00.000Z","path":"2025/09/29/applied-electronics/","text":"[Foundation] Applied Electronics1. Resistor1.1 Voltage DivisionResistors can be connected in series to divide voltage, commonly used for ADC inputs or op-amp biasing. Consider the resistance ratio and ADC resolution when designing a divider. If low quiescent current is required, the divider’s output impedance increases, which affects accuracy: The ADC’s internal sampling capacitor may not fully charge. The measured voltage may have error due to the RC time constant. When measuring high currents, use a high-power resistor to handle heat dissipation. 1.2 Current LimitingUsed to limit current to safe levels. Typical use cases: LED current control, MOSFET gate protection, transistor base drive. 1.3 Pull-Up / Pull-DownUsed to define a stable logic level on floating pins (e.g., MCU inputs, I²C lines). Provides source current for open-drain/open-collector circuits. Typical resistance ranges: I²C: 2.2k–400kΩ (commonly 4.7k–10kΩ) MCU GPIO: ~10kΩ When low-power operation is critical, choose higher resistance to reduce quiescent current. 1.4 Stabilization / DampingUsed to isolate and stabilize signal lines. Known as isolation resistors or damping resistors. Reduces ringing, EMI, and cross-coupling on high-speed or sensitive traces. 2. Capacitor2.1 Filtering / DecouplingUsed to smooth voltage and suppress high-frequency noise. Place as close as possible to IC power pins. Typical range: 0.01 µF – 100 µF. Pay attention to ESR (Equivalent Series Resistance) and stability. 2.2 Timing / OscillatorUsed in RC or LC timing and oscillator circuits. Time constant: τ = R × C Consider tolerance, temperature drift, and leakage current when selecting values. 2.3 Coupling / AC BlockingUsed to pass AC signals while blocking DC bias. Common in audio and amplifier stages. Choose capacitors with appropriate voltage ratings and low distortion. 2.4 Bypass / Noise ReductionUsed to shunt high-frequency noise and improve signal integrity. Small ceramic capacitors (e.g., 0.01 µF, 0.1 µF) are placed close to active components. Use multiple capacitors in parallel (e.g., 0.1 µF + 10 µF) to cover a wide frequency range. 2.5 Energy Storage / PulsingUsed to store and release energy for short bursts. Common in power supplies and motor drivers. Use large electrolytics or supercapacitors with sufficient voltage and ripple current ratings. 2.6 Snubber / DampingUsed to suppress voltage spikes, ringing, and protect switches. Typically RC series networks. Values depend on transient energy, switching frequency, and load characteristics.","link":"","tags":[{"name":"ece","slug":"ece","permalink":"https://www.robcholz.com/tags/ece/"},{"name":"framework","slug":"framework","permalink":"https://www.robcholz.com/tags/framework/"}]},{"title":"[Foundation] LCEDA","date":"2025-09-21T21:57:00.000Z","path":"2025/09/21/lcdea/","text":"[Foundation] LCEDAQuick Action Hide Selected Traces: Command+R Component Distributed By Region: Shift+P Select trace: selected tracing + Shift + W Steps Hide all traces. Distribute component by region. Hide all designators. Import DXF board. Start the layout.","link":"","tags":[{"name":"ece","slug":"ece","permalink":"https://www.robcholz.com/tags/ece/"},{"name":"framework","slug":"framework","permalink":"https://www.robcholz.com/tags/framework/"},{"name":"software","slug":"software","permalink":"https://www.robcholz.com/tags/software/"}]},{"title":"[Foundation]  PCB Layout Guidelines","date":"2025-09-20T21:51:00.000Z","path":"2025/09/20/pcb-layout/","text":"[Foundation] PCB Layout Guidelines1. BackgroundTrace Width vs Current (1 oz Copper) Current Typical Trace Width Notes GPIO / Low current 6 mil Standard signal width 0.5 A 10 mil Suitable for LEDs, small sensors 1 A 20 mil 2 A 40 mil 5 A 100 mil 10 A 200 mil Use solder mask opening and tin coverage 50 A 500 mil 100 A 1000 mil 200 A 2000 mil 500 A 5000 mil Use ≥4.5 oz copper or bus bars For high-current paths, widen the trace, increase copper thickness, or apply solder coverage. Additional Notes On compact boards, silkscreen reference designators can be omitted. Follow the 3W rule for high-speed signal integrity:→ Distance between traces ≥ 3× trace width. 2. Layer Stack and Net AllocationTwo-Layer Board Bottom layer should be as continuous GND plane as possible. Four-Layer Board Options Type Stackup Characteristics Type 1 GND / SIG-1 / SIG-2 / PWR Simple, but discontinuous impedance Type 2 SIG-1 / PWR / GND / SIG-2 Good for top-side components or signals Type 3 SIG-1 / GND / PWR / SIG-2 Good for bottom-side components 3. Layout ProcessEMC Improvement20H Rule Shrink the PWR plane by: 20 mil → reduces electric field by ~70% 100 mil → reduces electric field by ~98% Recommended Workflow Place mechanically constrained components first (USB, connectors, mounting holes). Plan functional regions: power, digital, analog. Route critical or high-speed signals first. Add fanout vias for low-current power nets. Complete all routing. Optimize critical traces (short, direct, orthogonal). Add teardrops and copper pour. Refine and balance copper planes. Run DRC checks, verify silkscreen and text orientation. Export Gerber, Pick &amp; Place, and BOM files. 4. Component Placement and RoutingGeneral Align designators consistently (e.g., all facing same direction). Quartz Crystal Guard crystal traces with a 10 mil GND ring. Do not route as differential pairs. Place as close as possible to MCU pins. Maintain a solid GND plane beneath. USB 2.0 Interface D+/D− are differential pairs (~90 Ω differential impedance). No copper pour or vias underneath pair. Add bidirectional TVS diode across D+/D−. Add unidirectional TVS diode across VBUS and GND. Ensure trace widths and planes handle expected VBUS current. Ground Domains Separate AGND, DGND, and PGND to minimize interference. Connect via: Single point (star ground), or Capacitive coupling between domains. Domain Recommendation AGND Close to analog reference voltage, filters, and amplifiers DGND Near digital ICs and loads PGND For high-current or power circuits; connect to star point or via capacitor DC-DC Converter Keep SW and FB traces as short as possible. Isolate inductor from analog and high-speed regions. Surround with GND via fence to confine EMI. Place input/output capacitors close to pins — from bulk → ceramic. Check chip’s thermal resistance (°C/W) and ensure adequate copper area or vias for heat dissipation. SDRAM DesignSingle SDRAM Point-to-point routing. Place close to MCU/BGA (600–800 mil without resistors; 800–1000 mil with). Decoupling capacitors must be adjacent to power pins. Dual SDRAM Place symmetrically relative to CPU. Prefer both on the same layer if space allows; otherwise, top/bottom mirrored. Maintain same routing length as single SDRAM layout. Routing Notes Target impedance ≈ 50 Ω. Keep each 9-bit group (D0–D7 + LDQM, D8–D15 + HDQM) on one layer. Maintain ≥3W spacing or 20 mil between data, address, and clock lines. Add GND guard traces (15–30 mil) where possible. Length-match tolerances: Data lines: ±50 mil Addr/Ctrl/Clock: ±100 mil TF (MicroSD) Card Speed Impedance Requirement ≤ 25 MHz ~50 Ω single-ended &gt; 25 MHz ~95 Ω differential","link":"","tags":[{"name":"ece","slug":"ece","permalink":"https://www.robcholz.com/tags/ece/"},{"name":"framework","slug":"framework","permalink":"https://www.robcholz.com/tags/framework/"}]},{"title":"[Foundation] Setup CLion with STM32CubeMX project for STM32 Development on macOS","date":"2023-01-22T03:52:00.000Z","path":"2023/01/22/clion-dev-macos/","text":"Setup CLion with STM32CubeMX project for STM32 Development on macOSKeil is very easy to handle for embedded development but might not have some functionalities such as code completion and inlay hint. This would trouble you especially when you want to conduct a big project. IDEs by Jetbrains like Intellij and Pycharm are very popular in the market. They have many advantages including charming UIs, good usability, safe refactoring. Doubtlessly, their IDEs could greatly assist your coding works. CLion is a cross-platform IDE for C/C++ development by Jetbrains, and I will guide you to setup a basic development environment for STM32 with CLion in this tutorial. ToolsSoftware A computer with macOS(for sure) CLion STM32CubeMX Homebrew Hardware STM32 MCU ST-Link/J-Link InstallationsPrerequisitesCLion The version should be higher than 2019.2. STM32CubeMX Downloading requires email verification. After you unzip the downloaded file, right-click the STM32CubeMX package and click Show Package Contents and right click to open the executable file inside the package. There will be an error window popped up. Click Cancel. Open Security &amp; Privacy in System Preferences and click Allow Anyway. Open STM32CubeMX executable file again in the package and click Open. Install STM32CubeMX. Homebrew Validate the installation brew -v. You should have installed these tools above before you continue the next step. ARM Toolchain Run brew tap ArmMbed/homebrew-formulae and brew install arm-none-eabi-gcc in the terminal. Validate the installation: arm-none-eabi-gcc -v. OpenOCDbrew install open-ocd Validate the installation: openocd -v. CLion ConfigurationsOpenOCD &amp; STM32CubeMX Paths Generally, both of your OpenOCD and CubeMX locations should be as same as me. Remember to test your paths by clicking Test. Toolchains Set build tools, C/C++ compilers and debuggers. You should use Bundled GDB or like me, manually set another GDB path for Debugger option. Create a new STM32CubeMX project. Here, you can either click Use to choose a board type or click Skip to choose one later. Click Open with STM32CubeMX to open the application. The default MCU is STM32F030F4Px. You can use STM32CubeMX like what you do everyday. You have to select STM32CubeIDe in Toolchain / IDE setting, and the Project Name should be kept as same as the project name in CLion. After you generate code and overwrite the old project files, click Assist and choose a board type in Run/Debug Configurations. You also need to edit the board config file in accordance to the version of your ST-Link. Congrats! You can now build, upload, and debug in CLion.","link":"","tags":[{"name":"ece","slug":"ece","permalink":"https://www.robcholz.com/tags/ece/"},{"name":"framework","slug":"framework","permalink":"https://www.robcholz.com/tags/framework/"},{"name":"software","slug":"software","permalink":"https://www.robcholz.com/tags/software/"}]},{"title":"This blog has been established","date":"2022-09-25T06:55:10.000Z","path":"2022/09/25/blog-post-title-from-file-name/","text":"This blog has been establishedBlog establishment","link":"","tags":[]}]